* Question
Many languages support a variety of iteration constructs, such as ~do~, ~for~, ~while~, and ~until~. In Scheme, iterative processes can be expressed in terms of ordinary procedure calls, so special iteration constructs provide no essential gain in computational power. On the other hand, such constructs are often convenient. Design some iteration constructs, give examples of their use, and show how to implement them as derived expressions.

* Answer
** Implementation
:PROPERTIES:
:header-args:scheme: :eval no
:END:
We can express ~for~, ~while~, and ~until~ as named ~let~ clauses:

+ ~for~ applies a procedure to every element in a list,
+ ~until~ evaluates a body (via ~begin~) until a predicate is met, and
+ ~while~ is the negation of ~until~.

~do~, which we do not implement here, can be seen as the combination of all three forms.

#+begin_src scheme :tangle 4.9.mceval.eval.for.scm
  (define (install-for-package)
    (put 'eval 'for
         (lambda (exp env)
           (eval (for->let exp) env)))
    'ok)

  (define (for-var exp)
    (caadr exp))

  (define (for-list exp)
    (list-ref (cadr exp) 2))

  (define (for-body exp)
    (cddr exp))

  (define (for->let exp)
    (make-let `((proc ,(make-lambda (list (for-var exp))
                                    (for-body exp))))
              (list
               (make-named-let 'iter
                               `((x ,(for-list exp))
                                 (acc nil))
                               (make-if '(null? x) 'acc
                                        '(iter (cdr x)
                                               (append acc
                                                       (list (proc (car x))))))))))
#+end_src

#+begin_src scheme :tangle 4.9.mceval.eval.until.scm
  (define (install-until-package)
    (put 'eval 'until
         (lambda (exp env)
           (eval (until->let exp) env)))
    'ok)

  (define (until-pred exp)
    (cadr exp))

  (define (until-body exp)
    (cddr exp))

  (define (until->let exp)
    (make-named-let 'iter
                    '((acc nil))
                    (make-if (until-pred exp) 'acc
                             `(iter ,(make-begin (until-body exp))))))

  (define (make-until pred body)
    (cons 'until (cons pred body)))
#+end_src

#+begin_src scheme :tangle 4.9.mceval.eval.while.scm
  (define (install-while-package)
    (put 'eval 'while
         (lambda (exp env)
           (eval (while->until exp) env)))
    'ok)

  (define (while-pred exp)
    (cadr exp))

  (define (while-body exp)
    (cddr exp))

  (define (while->until exp)
    (make-until `(not ,(while-pred exp))
                (while-body exp)))
#+end_src

#+begin_src scheme :tangle 4.9.mceval.scm
  ;; Inherit
  (load "4.8.mceval.scm")
  ;; Expression types
  (load "4.9.mceval.eval.for.scm")
  (load "4.9.mceval.eval.until.scm")
  (load "4.9.mceval.eval.while.scm")
  ;; Setup
  (install-for-package)
  (install-until-package)
  (install-while-package)
#+end_src

** Test
#+begin_src scheme :exports both
  ;; Load
  (load "4.9.mceval.scm")
  ;; Test
  (mc-eval '(let ((a '(a1 a2 a3))
                  (b '(b1 b2 b3)))
              (for (i in a)
                   (for (j in b)
                        (CONS i j)))))
#+end_src

#+RESULTS:
| (a1 . b1) | (a1 . b2) | (a1 . b3) |
| (a2 . b1) | (a2 . b2) | (a2 . b3) |
| (a3 . b1) | (a3 . b2) | (a3 . b3) |

#+begin_src scheme :exports both
  ;; Load
  (load "4.9.mceval.scm")
  ;; Test
  (mc-test '(let ((x 1))
              (until (< 9 x)
                     (set! x (+ x 1))
                     x))
           10)
#+end_src

#+RESULTS:
: ok

#+begin_src scheme :exports both
  ;; Load
  (load "4.9.mceval.scm")
  ;; Test
  (mc-test '(begin (define x 1)
              (while (< x 10)
                     (set! x (+ x 1))
                     x))
           10)
#+end_src

#+RESULTS:
: ok
